[
  {
    "title": "Ada",
    "subTitle": "Readable, correct, performant",
    "description": "Express intent with explicitness, describe properties with predicates and pre/post conditions, and import C/C++ functions or intrinsics.",
    "columns": 3,
    "items": [
      {
        "title": "Readable",
        "description": [
          "Express intent with explicitness and keywords over symbols and special structures.",
          "Express concepts like meaning in integers. Use built-in design by contract with pre/post-conditions and invariants. Model problems with typechecks and range constraints."
        ],
        "icon": "feat-readable"
      },
      {
        "title": "Correct",
        "description": [
          "Build with technology used in 40 years of reliability in planes, trains, and satellites.",
          "Use the SPARK subset to formally verify part or all of your program, and integrate existing SPARK crates available in the Alire package manager."
        ],
        "icon": "feat-correct"
      },
      {
        "title": "Performant",
        "description": [
          "Build native applications and take advantage of other libraries through binding to C and C++.",
          "Use inline assembly or compiler intrinsics when you need it. Control resources with scope-based resource control (RAII) and your own memory allocators."
        ],
        "icon": "feat-performant"
      }
    ]
  },
  {
    "title": "Set-up environment",
    "subTitle": "Package manager + toolchain",
    "description": "Download the Alire package manager and install the compiler.",
    "columns": 1
  },
  {
    "title": "SPARK",
    "subTitle": "From memory safety to functional correctness",
    "description": "Gradually adopt the SPARK subset to reach various levels of assurance. Higher levels take more effort, but give more benefits and stronger guarantees.",
    "items": [
      {
        "title": "Validates code",
        "description": "Restricts Ada packages to the SPARK subset. Avoids side-effects in functions and parameter aliasing.",
        "icon": "spark-stone"
      },
      {
        "title": "Checks initialization and data flow",
        "description": "No uninitialized variables are read or undesired access to globals occurs.",
        "icon": "spark-bronze"
      },
      {
        "title": "Proves the absence of run-time errors",
        "description": "No buffer and arithmetic overflow, division by zero, or values out of range, among others, can occur.",
        "icon": "spark-silver"
      },
      {
        "title": "Ensures key integrity properties",
        "description": "Verifies integrity of data and valid state transitions.",
        "icon": "spark-gold"
      }
    ]
  }
]
